init.el

(use-package which-key
  :diminish which-key-mode
  :config
  (which-key-mode))
